Tekla.Structures.ModelInternal.PickerExtension


Tekla.Structures.ModelInternal.PickerExtension.PickPoint(Tekla.Structures.Model.UI.Picker,Tekla.Structures.Geometry3d.Point)
Queries the user to pick a point from the model with reference to the given point.
picker:
ReferencePoint: The point to be used as reference.
Returns: The point the user picked.

Tekla.Structures.ModelInternal.PickerExtension.PickPoint(Tekla.Structures.Model.UI.Picker,System.String,Tekla.Structures.Geometry3d.Point)
Queries the user to pick a point from the model with reference to the given point.
picker:
Prompt: The string to display as user guidance.
ReferencePoint: The point to be used as reference.
Returns: The point the user picked.